#Series

In [4]:
import pandas as pd

시리즈 : 컬럼 + 인덱스 형식으로 저장, 관리, 리스트/배열과 유사한 형태
*컬럼 : 1차원 데이터의 모음 - 1개 컬럼
*컬럼들 > 데이터프레임

데이터프레임 : 컬럼들 + 인덱스, 엑셀 표(테이블) 유사한 형태

In [10]:
s1 = pd.Series([10, 20, 30])
s1[0:2]

0    10
1    20
dtype: int64

In [5]:
col_idx = ['A', 'B', 'C']
data = [10,20,30]
s2 = pd.Series(data, index=col_idx)
s2 #판다스 데이터타입 dtype

A    10
B    20
C    30
dtype: int64

In [7]:
s2[0] #인덱싱

C:\Users\Admin\AppData\Local\Temp\ipykernel_22952\2620002014.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0] #인덱싱

np.int64(10)

In [8]:
s2['A':'C'] #슬라이싱, 인덱스 이름 기반 추출

A    10
B    20
C    30
dtype: int64

In [11]:
dict_data = {'A':10, 'B':20, 'C':30} #딕셔너리 키 = 시리즈 인덱스
type(dict_data)
s3 = pd.Series(dict_data)

In [12]:
s3

A    10
B    20
C    30
dtype: int64

In [13]:
s3.dtypes #객체의 속성

dtype('int64')

In [14]:
s3.info() #객체의 메소드

<class 'pandas.core.series.Series'>
Index: 3 entries, A to C
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [19]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data)
print(s1)

# 인덱스 지정하여 시리즈 생성
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)
print(s2)

# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
d    4
dtype: int64

In [6]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [17]:
print(population[['서울', '인천']])

서울    9776
인천    1566
dtype: int64

In [18]:
population['제주'] = 20

In [19]:
population

서울    9776
부산    2729
인천    1566
대구    3158
제주      20
dtype: int64

In [20]:
population['제주'] = 203

In [21]:
population

서울    9776
부산    2729
인천    1566
대구    3158
제주     203
dtype: int64

# 데이터 프레임 DataFrame

In [22]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [23]:
pd.DataFrame(data, columns=['A', 'B', 'C'], index=['가','나','다'])

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [24]:
import numpy as np

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])

# 데이터프레임 생성
df = pd.DataFrame(arr, columns=['A', 'B', 'C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [26]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])

# 시리즈를 딕셔너리로 묶어 데이터프레임 생성
df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
})
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [27]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = pd.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [29]:
# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [30]:
print(df.index)    # 행 이름 출력
print(df.columns)  # 열 이름 출력

RangeIndex(start=0, stop=7, step=1)
Index(['이름', '나이', '점수'], dtype='object')

In [31]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']

# 열 순서는 그대로 유지되며, 새로운 이름이 순서대로 적용됨
print(df.columns)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

In [ ]:
# df.rename(columns={'name': '이름'}, inplace=True) #before:after
# inplace >> 새로운 df 복사본에서 확인하는 방법이 안전

In [34]:
df

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [35]:
# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== head() ===
    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

=== tail(3) ===
    이름  age  score
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

=== info() ===
<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 524.0+ bytes
None

=== describe() ===
             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [37]:
df.describe()

             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

# 인덱싱

[] 인덱싱

- iloc[] 행기반 인덱싱   >>> [행, 열]
- loc[] 이름기반(위치) 인덱싱 >>> [행이름, 열이름]

- : >> start:end 까지 슬라이싱
- loc[행이름:행이름]
- iloc[행번호:행번호] >>> end 행번호는 -1까지

In [45]:
# df[['이름','age']]
df.loc[:,['이름','age']] # loc[행,열]

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29

In [46]:
df.loc['A'] #시리즈로 꺼내짐

이름       김철수
age       25
score     85
Name: A, dtype: object

In [49]:
df.iloc[0:3] #행번호, 열

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [52]:
df.loc[:,'이름']

A    김철수
B    이영희
C    박민수
D    정수진
E    최영호
F    한미래
G    윤지원
Name: 이름, dtype: object

In [53]:
df.loc[:,['이름','score']]

    이름  score
A  김철수     85
B  이영희     92
C  박민수     78
D  정수진     95
E  최영호     88
F  한미래     73
G  윤지원     91

In [58]:
df.loc['C',:]

이름       박민수
age       22
score     78
Name: C, dtype: object

In [60]:
print(df.loc['D','age'])

31

In [69]:
df.loc['C':'F','이름':'age']

    이름  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [70]:
df.loc['A':'G','score']

A    85
B    92
C    78
D    95
E    88
F    73
G    91
Name: score, dtype: int64

In [ ]:
df['B':'E']

#boolean 인덱싱

In [82]:
df[df['score'] > 90 ]#vectorization boolean list 요소값 True, False

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [65]:
df.loc[df['age']>=27,:]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [72]:
df.loc[df['score']>=90,['이름','score']]

    이름  score
B  이영희     92
D  정수진     95
G  윤지원     91

In [77]:
df.loc[(df['age']>=25) & (df['score']>=90), :]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [78]:
df.iloc[0]

이름       김철수
age       25
score     85
Name: A, dtype: object

In [85]:
df.iloc[2,0]

'박민수'

In [86]:
df.iloc[0:3,]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [88]:
print(df.iloc[-1,2])

91

In [91]:
df.iloc[0:4]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95

In [93]:
df.iloc[2:6, :2]

    이름  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [94]:
df.iloc[:,1]

A    25
B    28
C    22
D    31
E    27
F    24
G    29
Name: age, dtype: int64

In [95]:
df.iloc[:4, 2]

A    85
B    92
C    78
D    95
Name: score, dtype: int64

In [99]:
df.iloc[-3:, [0,2]]

    이름  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [100]:
df.iloc[[0,2,4,6]]

    이름  age  score
A  김철수   25     85
C  박민수   22     78
E  최영호   27     88
G  윤지원   29     91

#행추가와 열추가

In [102]:
# loc를 사용하여 새로운 행 추가
df.loc['H'] = ['장민호', 26, 88]
df

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  장민호   26     88

In [104]:
# 직접 할당으로 열 추가
df['grade'] = ['A', 'B', 'A', 'A', 'B', 'C', 'A','D']
df

    이름  age  score grade
A  김철수   25     85     A
B  이영희   28     92     B
C  박민수   22     78     A
D  정수진   31     95     A
E  최영호   27     88     B
F  한미래   24     73     C
G  윤지원   29     91     A
H  장민호   26     88     D

In [3]:
# insert() 메서드로 특정 위치에 열 추가
df.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'])
df

NameError: name 'df' is not defined

#행 삭제와 열 삭제

-drop() 메서드를 사용하고, axis=0 매개변수를 사용하여 행을 삭제한다.

-inplace=True를 설정하면 원본 데이터프레임을 직접 수정할 수 있다

In [110]:
# 인덱스로 행 삭제
df.drop('A', axis=0)  # 'A' 인덱스의 행 삭제

# 여러 행 한 번에 삭제
df.drop(['B', 'C'], axis=0)
df

    이름 student_id  age  score grade
A  김철수       S001   25     85     A
B  이영희       S002   28     92     B
C  박민수       S003   22     78     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     D

In [2]:
#axis=1 매개변수를 설정하여 열을 삭제한다. 


# 열 이름으로 열 삭제
df.drop('grade', axis=1)  # 'grade' 열 삭제

# 여러 열 한 번에 삭제
df.drop(['age', 'score'], axis=1)

NameError: name 'df' is not defined